Rotation Property
 The rotation of the viewport on the sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ViewportRotation Rotation { get; set; }
Visual Basic
Public Property Rotation As ViewportRotation
	Get
	Set
Visual C++
public:
property ViewportRotation Rotation {
	ViewportRotation get ();
	void set (ViewportRotation value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Viewport Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →